#單純寫法
# a=[]
# for i in range(1,10):
#     a.append(i*i)
# print(a) #[1, 4, 9, 16, 25, 36, 49, 64, 81]

#使用串列生成式
# b=[j*j for j in range(1,10)]
# print(b)

#=================================================

#單純寫法
# a=[10,20,30,40,50,60,70,80,90]
# b=[]
# for i in a:
#     b.append(max(a)-i)
# print(b) #[80, 70, 60, 50, 40, 30, 20, 10, 0]

#使用串列生成式
# a=[10,20,30,40,50,60,70,80,90]
# b=[max(a)-i for i in a]
# print(b) #[80, 70, 60, 50, 40, 30, 20, 10, 0]

#=================================================

#如果需要兩層 for 迴圈才能生成的串列，同樣也能使用串列生成式來產生。
#單純寫法
#將兩層for迴圈的i和j加在一起，變成新串列的項目
# a=[]
# for i in 'abc':
#     for j in range(1,4):
#         a.append(i+str(j))
# print(a) #['a1', 'a2', 'a3', 'b1', 'b2', 'b3', 'c1', 'c2', 'c3']

#使用串列生成式
#兩個for迴圈分別產生i和j
# a=[i+str(j) for i in 'abc' for j in range(1,4)]
# print(a) #['a1', 'a2', 'a3', 'b1', 'b2', 'b3', 'c1', 'c2', 'c3']

#=================================================

#可以加入 Python 的內建函式，針對產生的項目做處理
#單純寫法
# a=[[100,200,300,400,500],[100,200,500,2,1]]
# b=[]
# for i in a:
#     b.append(min(i)) #將二維串列中每個串列裡的最小值取出，變成新的串列
# print(min(b)) #1

#使用串列生成式
# a=[[100,200,300,400,500],[100,200,500,2,1]]
# print(min([min(i) for i in a])) #1

#=================================================

#串列生成式搭配if
#單純寫法
# a=[]
# for i in range(1,10):
#     if i%2 == 0:
#         a.append(i) #取出偶數放入變數a
# print(a) #[2, 4, 6, 8]

#使用串列生成式
# a=[i for i in range(1,10) if i%2 == 0]
# print(a) #[2, 4, 6, 8]

#=================================================

#單純寫法
# a=[]
# for i in range(1,10):
#     if i%2 == 0:
#         a.append(i) #取出偶數放入變數a
#     else:
#         a.append(100) #如果是奇數，將100放入變數a
# print(a) #[100, 2, 100, 4, 100, 6, 100, 8, 100]

#使用串列生成式
# a=[i if i%2==0 else 100 for i in range(1,10)]
# print(a) #[100, 2, 100, 4, 100, 6, 100, 8, 100]

#=================================================

#字典生成式
#單純寫法
# a={}
# for i in range(1,10):
#     a[i]=i*i #將i*i對應指定的鍵
# print(a) #{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81}

#使用字典生成式
# a={i:i*i for i in range(1,10)}
# print(a) #{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81}

#=================================================

#集合生成式
#單純寫法
# a=set() 
# for i in range(1,10):
#     a.add(i*i) #將i*i新增到集合裡
# print(a) #{64, 1, 4, 36, 9, 16, 49, 81, 25} (沒有順序)

#使用集合生成式
# a={i*i for i in range(1,10)}
# print(a) #{64, 1, 4, 36, 9, 16, 49, 81, 25} (沒有順序)

#=================================================

#元組(數組)生成式
a=tuple(i for i in range(10))
print(a)

#也可以使用運算式以及 if 判斷式產生 tuple
a=tuple(i*i for i in range(10) if i>5)
print(a) #(36, 49, 64, 81)